In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
a=pd.Series([1, 2, 3])
(a)

0    1
1    2
2    3
dtype: int64

In [4]:
(a.index)

RangeIndex(start=0, stop=3, step=1)

In [6]:
(a.size)

3

In [7]:
(a.shape)

(3,)

In [8]:
(a.dtype)

dtype('int64')

In [9]:
(a.empty)

False

In [10]:
b=pd.Series([])

In [12]:
(b.empty)

True

In [13]:
(a.hasnans)

False

In [14]:
c=pd.Series([1, 2, np.nan])
(c)

0    1.0
1    2.0
2    NaN
dtype: float64

In [2]:
import pandas as pd
import numpy as np
cd=pd.Series([1, 2, np.nan])
print(cd)
print(cd.dropna())

0    1.0
1    2.0
2    NaN
dtype: float64
0    1.0
1    2.0
dtype: float64

In [3]:
import pandas as pd
import numpy as np
cd=pd.DataFrame([1, 2, np.nan],[2,3,4])
print(cd)
print(cd.dropna())

     0
2  1.0
3  2.0
4  NaN
     0
2  1.0
3  2.0

In [15]:
(c.hasnans)

True

In [17]:
(a.nbytes)

24

In [1]:
import pandas as pd

In [17]:
data=[1, 2, 3, 4, 5]
df=pd.DataFrame(data)
(df)

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
import pandas as pd
d=[['a', 20],['b', 21],['c', 21],['d', 21]]
df=pd.DataFrame(d, columns=['Name','grade'])
print(df)

  Name  grade
0    a     20
1    b     21
2    c     21
3    d     21

In [5]:
import pandas as pd
import numpy as np
d1=[['a', 20],['b', 21],['c', 21],['d', np.nan]]
df1=pd.DataFrame(d1, columns=['Name','grade'])
print(df1)
print(df1.dropna())

  Name  grade
0    a   20.0
1    b   21.0
2    c   21.0
3    d    NaN
  Name  grade
0    a   20.0
1    b   21.0
2    c   21.0

In [2]:
#dataframe using dictionary
import pandas as pd

In [5]:
data={'name':['tom', 'jack', 'steve', 'ricky'], 'age':[28, 34, 29, 42]}
df=pd.DataFrame(data)
df

    name  age
0    tom   28
1   jack   34
2  steve   29
3  ricky   42

In [7]:
data=[{'a':1, 'b':2},{'a':5, 'b':10, 'c':20}]
df=pd.DataFrame(data)
(df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [8]:
data=[{'a':1, 'b':2},{'a':5, 'b':10, 'c':20}]
df=pd.DataFrame(data, index=['first', 'second'])
(df)

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [10]:
d={'one':pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two':pd.Series([1, 2, 3, 4], index=['a', 'b','c', 'd'])}
df=pd.DataFrame(d)
(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [11]:
d={'one':pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two':pd.Series([1, 2, 3, 4], index=['w', 'x','y', 'z'])}
df=pd.DataFrame(d)
(df)

   one  two
a  1.0  NaN
b  2.0  NaN
c  3.0  NaN
w  NaN  1.0
x  NaN  2.0
y  NaN  3.0
z  NaN  4.0

In [12]:
d={'one':pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two':pd.Series([1, 2, 3, 4], index=['a', 'b','c', 'd'])}
df=pd.DataFrame(d)
(df['one'])

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [17]:
d={'one':pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two':pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df=pd.DataFrame(d)
#adding a new column to an existing DataFrame object with column label by passing new series
("adding a new column by passing as Series:")
df['three']=pd.Series([10, 20, 30], index=['a', 'b', 'c'])
(df)
("adding a new column using the existing column in DataFrame:")
df['four']=df['one']+df['three']
(df)
df['five']=df['one']+df['two']
(df)

   one  two  three  four  five
a  1.0    1   10.0  11.0   2.0
b  2.0    2   20.0  22.0   4.0
c  3.0    3   30.0  33.0   6.0
d  NaN    4    NaN   NaN   NaN

In [16]:
d={'one':pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two':pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']),
   df: ['three':pd.Series([10, 20, 30], index=['a', 'b', 'c'])]}
df=pd.DataFrame(d)
("our dataframe is:")
(df)
#using del function
("deleting the first column using DEL function:")
del df['one']
(df)
#using pop function
("deleting another column using pop function:")
df.pop('two')
(df)

SyntaxError: ':' expected after dictionary key (2737086521.py, line 3)

In [1]:
import numpy as np
import pandas as pd

In [4]:
a=pd.DataFrame([[1, 2, 3], [10, 20, 30]])
(a)

    0   1   2
0   1   2   3
1  10  20  30

In [6]:
a.drop(1)

   0  1  2
0  1  2  3

In [7]:
a.drop(1, axis=1)

    0   2
0   1   3
1  10  30

In [12]:
a.drop(2, axis=1, inplace=True)
(a)

    1
0   2
1  20

In [18]:
d={'one':pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two':pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df=pd.DataFrame(d)
df.loc['b']

one    2.0
two    2.0
Name: b, dtype: float64

In [19]:
df.loc['d']

one    NaN
two    4.0
Name: d, dtype: float64

In [7]:
import pandas as pd
c=pd.DataFrame([[1, 2], [3, 4]])
c

   0  1
0  1  2
1  3  4

In [9]:
c.loc[0]

0    1
1    2
Name: 0, dtype: int64

In [10]:
c.loc[1]

0    3
1    4
Name: 1, dtype: int64

In [1]:
import pandas as pd

In [2]:
d = {'one': pd.Series([1, 2, 3], index=['a','b','c']),
     'two':pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df=pd.DataFrame(d)
df[2:4]

   one  two
c  3.0    3
d  NaN    4

In [4]:
df.loc['d'] ['two']

4.0

In [6]:
df.loc['d'] ['one']

nan

In [20]:
sr=pd.Series([19.5, 16.8, 22.78, 20.124, 18.1002])
sr

0    19.5000
1    16.8000
2    22.7800
3    20.1240
4    18.1002
dtype: float64

In [22]:
#truncate
s=sr.truncate(before=2, after=3)
s

2    22.780
3    20.124
dtype: float64

In [27]:
s=sr.truncate(before=1, after=5)
s

1    16.8000
2    22.7800
3    20.1240
4    18.1002
dtype: float64

In [30]:
s=sr.truncate(before=3)
s

3    20.1240
4    18.1002
dtype: float64

In [1]:
import pandas as pd

In [15]:
dict={'name':["aparna", "pankaj", "sudhir", "geeku"],
      'degree':["mba", "bca", "m.tech", "mba"],
      'score':[90, 48, 80, 98]}


df=pd.DataFrame(dict)
#iterating over rows using iterrows() function
for i, j in df.iterrows():
    print(i,j)

0 name      aparna
degree       mba
score         90
Name: 0, dtype: object
1 name      pankaj
degree       bca
score         48
Name: 1, dtype: object
2 name      sudhir
degree    m.tech
score         80
Name: 2, dtype: object
3 name      geeku
degree      mba
score        98
Name: 3, dtype: object

In [20]:
#sorting data frame by name
df.sort_values("score", axis=0, ascending=True,
                 inplace=True, na_position='first')
(df)

     name  degree  score
1  pankaj     bca     48
2  sudhir  m.tech     80
0  aparna     mba     90
3   geeku     mba     98